# -*-mode:ruby-*- vim:ft=ruby

# ~/.Brewfile
# =============================================================================
# Project dependencies installed using `brew bundle` or `~/dotfiles.sh`.
#
# See https://github.com/Homebrew/homebrew-bundle

tap "buo/cask-upgrade"
tap "eugenmayer/dockersync"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "twpayne/taps"
tap "hashicorp/tap"

# Core utilities
brew "adminer"                              # Database management in PHP
brew "asdf"                                 # Extendable version manager
brew "autoconf"                             # Configuration shell script maker
brew "bash"                                 # Bourne again shell
brew "bash-completion"                      # Autocompletions for `bash`
brew "colordiff"                            # Colour-highlighted diff output
brew "direnv"                               # Directory specific env variables
brew "fzf"                                  # Fuzzy finder for command line
brew "flake8"                               # Python style guide enforcer
brew "fswatch"                              # File change monitor
brew "geoip"                                # Geographic IP lookup
brew "gnupg"                                # GNU privacy guard
brew "htop"                                 # Interactive system-monitor
brew "jq"                                   # JSON processor
brew "yq"                                   # YAML processor
#brew "graphicsmagick"                      # GraphicsMagick image processor
#brew "imagemagick"                         # ImageMagick image processor
brew "jpegoptim"                            # JPEG compressor/optimizer
brew "less"                                 # Terminal pager
brew "lesspipe"                             # Input filter for `less`
brew "mariadb"                              # MariaDB RDBMS
brew "micro"                                # Micro text editor
brew "nano"                                 # Nano text editor
brew "npm"                                  # Node package manager
#brew "optipng"                             # PNG compressor/optimizer
brew "tidy-html5"                           # HTML corrector
brew "neofetch"                             # System information tool
brew "php-code-sniffer"                     # PHP coding standard validator
brew "phplint"                              # PHP code quality checker
brew "phpmd"                                # PHP mess detector
brew "phpunit"                              # PHP unit testig framework
brew "pipenv"                               # Python packaging tool
brew "postgresql", restart_service: true    # PostgreSQL RDBMS
brew "pyenv"                                # Python version manager
brew "pyenv-virtualenv"                     # virtualenv and conda manager
brew "ruby-build"                           # Ruby version managger
brew "rbenv"                                # Ruby environment manager
brew "ripgrep"                              # Recursive Regex search tool
brew "rsync"                                # File transfer and sync tool
brew "screenfetch"                          # Screenshot information tool
brew "starship"                             # Starship cross-shell prompt
brew "telnet"                               # Virtual terminal client
brew "tmuxinator"                           # Tmux session controller
brew "travis"                               # Travis CI client
brew "tree"                                 # Directory tree viewer
brew "unison"                               # Unison file synchronizer
brew "wget"                                 # Web content downloader
brew "zlib"                                 # Lossless data-compression library
brew "zoxide"                               # Smarter cd command
brew "eugenmayer/dockersync/unox"           # Docker sync daemon
brew "heroku/brew/heroku"                   # Heroku CLI
brew "twpayne/taps/chezmoi"                 # Chezmoi dotfiles manager

# DevOps & Cloud Tools
brew "ansible"                              # IT automation tool
brew "awscli"                               # AWS command line interface
brew "azure-cli"                            # Microsoft Azure CLI
brew "doctl"                                # DigitalOcean CLI
brew "docker"                               # Container platform
brew "docker-compose"                       # Multi-container Docker apps
brew "docker-credential-helper"             # Docker credential helper
brew "k9s"                                  # Kubernetes CLI manager
brew "kubectx"                              # Switch between kubectl contexts
brew "kubernetes-cli"                       # Kubernetes command-line tool
brew "helm"                                 # Kubernetes package manager
brew "helmfile"                             # Deploy Kubernetes Helm Charts
brew "kustomize"                            # Kubernetes config management
brew "minikube"                             # Local Kubernetes cluster
brew "packer"                               # Tool for creating machine images
brew "hashicorp/tap/terraform"              # Infrastructure as Code tool
brew "terraform-docs"                       # Generate docs from Terraform
brew "terragrunt"                           # Terraform wrapper
brew "tflint"                               # Terraform linter
brew "vault"                                # Secrets management tool

# Network & System Tools
brew "arp-scan"                             # ARP scanner
brew "bandwhich"                            # Network utilization monitor
brew "curl"                                 # HTTP client
brew "dnsutils"                             # DNS utilities (dig, nslookup)
brew "nmap"                                 # Network mapper
brew "netcat"                               # Networking utility
brew "openssl"                              # Cryptography toolkit
brew "socat"                                # Socket relay
brew "ssh-copy-id"                          # SSH public key installer
brew "sshuttle"                             # VPN over SSH
brew "tcpdump"                              # Packet analyzer
brew "traceroute"                           # Network diagnostic tool
brew "watch"                                # Execute program periodically

# Git & Version Control
brew "gh"                                   # GitHub CLI
brew "git"                                  # Distributed version control
brew "git-extras"                           # Extra Git utilities
brew "git-flow"                             # Git extensions for Vincent
brew "git-lfs"                              # Git Large File Storage
brew "tig"                                  # Text-mode interface for Git

# Security & 1Password
brew "1password-cli"                        # 1Password command line tool
brew "age"                                  # File encryption tool
brew "sops"                                 # Encrypted file editor
brew "pass"                                 # Password manager

# Monitoring & Observability
brew "grafana"                              # Metrics dashboard
brew "prometheus"                           # Monitoring system

# Fonts (Nerd Fonts for terminal icons)
cask "font-dejavusansmono-nerd-font-mono"   # DejaVu Sans Mono Nerd Font
cask "font-firacode-nerd-font"              # Fira Code Nerd Font
cask "font-hack-nerd-font-mono"             # Hack Mono Nerd Font
cask "font-meslo-nerd-font-mono"            # Meslo Mono Nerd Font
cask "font-sourcecodepro-nerd-font-mono"    # Source Code Pro Mono Nerd Font

# Applications
cask "powershell"                           # Cross-platform shell
cask "wireshark"                            # Network protocol analyzer
cask "postman"                              # API development environment
cask "visual-studio-code"                   # Code editor

